src/app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
      @article = Article.find params[:id]

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Test"], ["text", "Test"], ["created_at", 2016-11-24 19:56:57 UTC], ["updated_at", 2016-11-24 19:56:57 UTC]]
---
    def create
      @article = Article.new article_params
      if @article.save