src/app/controllers/documents_controller.rb

    def index
        @articles = Articles.all
---
SELECT "articles".* FROM "articles"

    def show
      @article = Articles.find params[:id]
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]